---
kind: type
id: T:Autodesk.Revit.DB.OBJImportOptions
source: html/030954c6-4fe3-9ec0-6be0-0019609769d0.htm
---
# Autodesk.Revit.DB.OBJImportOptions

The import options used to import OBJ format files.

## Syntax (C#)
```csharp
public class OBJImportOptions : BaseImportOptions
```